"""

序列
    列表 list []
>>> for index, item in enumerate(['印度飞饼','给你大巴掌','拍地板','肥牛冲撞','我闪']):
	print(index, item)

	
0 印度飞饼
1 给你大巴掌
2 拍地板
3 肥牛冲撞
4 我闪
>>> >>> for q in ['印度飞饼','给你大巴掌','拍地板','肥牛冲撞','我闪']:
	print(q)

	
印度飞饼
给你大巴掌
拍地板
肥牛冲撞
我闪
>>> len([1,2,3])
3
>>> 1 in [1,2,3]
True
>>> 1 not in [1,2,3]
False
>>> max([11,3,4])
11
>>> max('hello woeld')
'w'
>>> li = [1,23,3,4,5]  #添加
>>> li.append(1)
>>> li
[1, 23, 3, 4, 5, 1]
>>> 
>>> li[-1] = '3'  #修改
>>> li
[1, 23, 3, 4, 5, '3']
>>> li[1] = '2'
>>> li
[1, '2', 3, 4, 5, '3']
>>> li = [1,23,3,4,5][1]
>>> li[0][0] =3333


    元组 tuple  () 元组不能被修改

     for i in (1,2,3):
	print(i)



     for c in 'hello':
        print(c)

	
h
e
l
l
o


集合

type({1,2,3})
<class 'set'

-----可修改的   >>> s = {1,2,3}
>>> s. add(4)
>>> s
{1, 2, 3, 4}
>>> s.remove(2)
>>> 
>>> s
{1, 3, 4}
>>> 

无序的
for i in {1,2,3}:
	print(i)

	
1
2
3
>>> for i in {6,3,1}:
	print(i)

	
1
3
6



不可重复的
>>> a = {1,2,2,3,4,4}
>>> a
{1, 2, 3, 4}

可交并差运算
>>> {1,2,3} | {3,4}
{1, 2, 3, 4}
>>> {1,2,3} & {3,4}
{3}
>>> 



字典 Key-- Value


>>> {1:'A', 2:'B'}
{1: 'A', 2: 'B'}
>>> {1:'A', 2:'B'}[1]
'A'


>>> {'Q':'印度飞饼','W':'给你大巴掌','E':'拍地板','R':'肥牛冲撞','D':'我闪'}['W']
'给你大巴掌'
>>> {'Q':'印度飞饼','Q':'HASAKAI','W':'给你大巴掌','E':'拍地板','R':'肥牛冲撞','D':'我闪'}
{'Q': 'HASAKAI', 'W': '给你大巴掌', 'E': '拍地板', 'R': '肥牛冲撞', 'D': '我闪'}
>>> {'Q':'印度飞饼','W':'印度飞饼','E':'拍地板','R':'肥牛冲撞','D':'我闪'}
{'Q': '印度飞饼', 'W': '印度飞饼', 'E': '拍地板', 'R': '肥牛冲撞', 'D': '我闪'}
>>> 

>>> for key in {'Q':'印度飞饼','W':'给你大巴掌','E':'拍地板','R':'肥牛冲撞','D':'我闪'}.keys():
	print({'Q':'印度飞饼','W':'给你大巴掌','E':'拍地板','R':'肥牛冲撞','D':'我闪'}[key])

	
印度飞饼
给你大巴掌
拍地板
肥牛冲撞
我闪



dd = [{'name':'张三','phone':'1510000000'},{'name':'李四','phone':'1510002222'},{'name':'王五','phone':'1510003333'}]
>>> dd
[{'name': '张三', 'phone': '1510000000'}, {'name': '李四', 'phone': '1510002222'}, {'name': '王五', 'phone': '1510003333'}]
>>> for i in dd:
	print(i)

	
{'name': '张三', 'phone': '1510000000'}
{'name': '李四', 'phone': '1510002222'}
{'name': '王五', 'phone': '1510003333'}


>>> Q = [{'A':['俄罗斯','沙特','埃及','乌拉圭']},{'B':['俄罗斯','沙特','埃及','乌拉圭']},{'C':['俄罗斯','沙特','埃及','乌拉圭']},{'D':['俄罗斯','沙特','埃及','乌拉圭']}]
>>> Q
[{'A': ['俄罗斯', '沙特', '埃及', '乌拉圭']}, {'B': ['俄罗斯', '沙特', '埃及', '乌拉圭']}, {'C': ['俄罗斯', '沙特', '埃及', '乌拉圭']}, {'D': ['俄罗斯', '沙特', '埃及', '乌拉圭']}]
>>> for i in Q:
	print(i)

	
{'A': ['俄罗斯', '沙特', '埃及', '乌拉圭']}
{'B': ['俄罗斯', '沙特', '埃及', '乌拉圭']}
{'C': ['俄罗斯', '沙特', '埃及', '乌拉圭']}
{'D': ['俄罗斯', '沙特', '埃及', '乌拉圭']}
>>> 

    字符串 str

    创建、索引、切片、修改、遍历


序列（有序、可重复）：列表list、元组tuple、字符串str   -----列表可修改，元组字符串不可修改
集合set:  无序、可修改、不重复
字典dict: 无序、可修改、key不能重复
	
1
2
3
"""
type((1,2,3))
